#+TITLE: Emacs Literate Configuration
#+AUTHOR:  Eric Miller
#+PROPERTY: header-args :tangle yes

** Annotations

#+begin_src emacs-lisp
  (use-package annotate
    :config
    (add-hook 'prog-mode-hook #'annotate-mode))
#+end_src

#+RESULTS:
| elpaca< | annotate | annotate | annotate | (queued) | /Users/ericm/.emacs.d/elpaca/repos/annotate/ | /Users/ericm/.emacs.d/elpaca/builds/annotate | nil | nil | (elpaca--clone elpaca--configure-remotes elpaca--checkout-ref elpaca--run-pre-build-commands elpaca--clone-dependencies elpaca--link-build-files elpaca--generate-autoloads-async elpaca--byte-compile elpaca--compile-info elpaca--install-info elpaca--add-info-path elpaca--run-post-build-commands elpaca--activate-package) | (:package annotate :fetcher github :repo bastibe/annotate.el :files (*.el *.el.in dir *.info *.texi *.texinfo doc/dir doc/*.info doc/*.texi doc/*.texinfo lisp/*.el (:exclude .dir-locals.el test.el tests.el *-test.el *-tests.el LICENSE README* *-pkg.el)) :protocol https :inherit t :depth 1) | nil | nil | nil | nil | 2 | (25700 8549 863789 0) | nil | nil | ((queued (25700 8549 863793 0) Package queued 1)) | nil |

